#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
google_project_service.services["run.googleapis.com"]: Refreshing state... [id=baynext-x1307/run.googleapis.com]
google_project_service.services["artifactregistry.googleapis.com"]: Refreshing state... [id=baynext-x1307/artifactregistry.googleapis.com]
google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=baynext-x1307/iam.googleapis.com]
google_service_account.cloud_run_job_sa: Refreshing state... [id=projects/baynext-x1307/serviceAccounts/baynext-ml-job-sa@baynext-x1307.iam.gserviceaccount.com]
google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=baynext-x1307/cloudresourcemanager.googleapis.com]
google_project_iam_member.cloud_run_job_sa_run_invoker: Refreshing state... [id=baynext-x1307/roles/run.invoker/serviceAccount:baynext-ml-job-sa@baynext-x1307.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_job_sa_artifact_registry_reader: Refreshing state... [id=baynext-x1307/roles/artifactregistry.reader/serviceAccount:baynext-ml-job-sa@baynext-x1307.iam.gserviceaccount.com]
google_cloud_run_v2_job.baynext_ml_job: Refreshing state... [id=projects/baynext-x1307/locations/europe-west1/jobs/baynext-ml-job]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/baynext-x1307/locations/europe-west1/repositories/baynext-docker-repo]
data.google_artifact_registry_docker_image.backend_image: Reading...
data.google_artifact_registry_docker_image.backend_image: Read complete after 1s [id=https://artifactregistry.googleapis.com/v1/projects/baynext-x1307/locations/europe-west1/repositories/baynext-docker-repo/dockerImages/baynext-backend:latest]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_job.baynext_ml_job will be updated in-place
  ~ resource "google_cloud_run_v2_job" "baynext_ml_job" {
      - client                   = "gcloud" -> null
      - client_version           = "530.0.0" -> null
        id                       = "projects/baynext-x1307/locations/europe-west1/jobs/baynext-ml-job"
        name                     = "baynext-ml-job"
        # (22 unchanged attributes hidden)

      ~ template {
          ~ labels      = {
              - "commit-sha"                 = "5c9524a08b6d1f61e19484046eced996704aa7c2" -> null
              - "goog-terraform-provisioned" = "true" -> null
              - "managed-by"                 = "github-actions" -> null
            }
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # google_cloud_run_v2_service.baynext_backend_service will be created
  + resource "google_cloud_run_v2_service" "baynext_backend_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west1"
      + name                    = "baynext-backend-service"
      + observed_generation     = (known after apply)
      + project                 = "baynext-x1307"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "europe-west1-docker.pkg.dev/baynext-x1307/baynext-docker-repo/baynext-backend@sha256:f591d247ebb8d1580da3f6444406779c2de1e489137be43b28d89511e3f1df0b"

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }
            }
        }
    }

  # google_project_iam_member.cloud_run_backend_sa_artifact_registry_reader will be created
  + resource "google_project_iam_member" "cloud_run_backend_sa_artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com"
      + project = "baynext-x1307"
      + role    = "roles/artifactregistry.reader"
    }

  # google_project_iam_member.cloud_run_backend_sa_run_invoker will be created
  + resource "google_project_iam_member" "cloud_run_backend_sa_run_invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com"
      + project = "baynext-x1307"
      + role    = "roles/run.servicesInvoker"
    }

  # google_project_iam_member.cloud_run_job_sa_run_invoker must be replaced
-/+ resource "google_project_iam_member" "cloud_run_job_sa_run_invoker" {
      ~ etag    = "BwY6Ezpk9ZA=" -> (known after apply)
      ~ id      = "baynext-x1307/roles/run.invoker/serviceAccount:baynext-ml-job-sa@baynext-x1307.iam.gserviceaccount.com" -> (known after apply)
      ~ role    = "roles/run.invoker" -> "roles/run.jobsExecutorWithOverrides" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_service_account.cloud_run_backend_sa will be created
  + resource "google_service_account" "cloud_run_backend_sa" {
      + account_id   = "baynext-backend-sa"
      + disabled     = false
      + display_name = "Service Account for Baynext Backend"
      + email        = "baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:baynext-backend-sa@baynext-x1307.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "baynext-x1307"
      + unique_id    = (known after apply)
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @lgrosjean, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*